Tekla.Structures.ModelInternal.dotWire_t
Serialization structure for RebarGroup inner rebars.
Stores several wires at a time in order to reduce remote call overhead.

Tekla.Structures.ModelInternal.dotWire_t.MAX_REBAR_GEOMETRY_POLYGON_COUNT
The maximum number of polygons that can be transferred using this structure.

Tekla.Structures.ModelInternal.dotWire_t.MAX_REBAR_GEOMETRY_POINT_COUNT
The maximum number of points that can be transferred using this structure.

Tekla.Structures.ModelInternal.dotWire_t.GroupIdentifier
Identifier of the load group for which we search the inner rebars

Tekla.Structures.ModelInternal.dotWire_t.ClientIdentifier
The client identifier.

Tekla.Structures.ModelInternal.dotWire_t.WithHooks
This variable tells whether the hooks should be included in the geometry or not.

Tekla.Structures.ModelInternal.dotWire_t.WithoutClashes
This variable tells whether the overlapped geometry is returned.

Tekla.Structures.ModelInternal.dotWire_t.LengthAdjustments
This variable tells whether rounding and step tapering are applied.

Tekla.Structures.ModelInternal.dotWire_t.UsingLists
This variable tells whether the data is too large to pass in one go and instead is using the ListExporter

Tekla.Structures.ModelInternal.dotWire_t.nPolygons
The number of polygons.

Tekla.Structures.ModelInternal.dotWire_t.anPolygonPoints
Indicates the number of polygon points for each wire.

Tekla.Structures.ModelInternal.dotWire_t.aDiameter
The diameter of the wire.

Tekla.Structures.ModelInternal.dotWire_t.aPositionPoints
Position points for a wire.

Tekla.Structures.ModelInternal.dotWire_t.aBendingRadiuses
The bending radiuses of the wire